run/cases/RELPimpleFoam/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    "(inlet|outlet|up|down|front|back)"
    {
        type            RELVelocity;
        inletValue      uniform (0 0 0);
        relative        no;
        value           uniform (0 0 0);    // initial value
    }
    
    body
    {
        type            noSlip;
    }
}


// ************************************************************************* //
