run/cases/RELPimpleFoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

xmin -5;
xmax  17;
ymin -5;
ymax  6;
zmin -5.2;
zmax  5.8;

vertices 
(

    ($xmin  $ymin  $zmin)
    ($xmax  $ymin  $zmin)
    ($xmax  $ymax  $zmin)
    ($xmin  $ymax  $zmin)
    ($xmin  $ymin  $zmax)
    ($xmax  $ymin  $zmax)
    ($xmax  $ymax  $zmax)
    ($xmin  $ymax  $zmax)

);

edges
(
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 15 15) 
    simpleGrading()
    (
        1 1 1
        /*
        (
            ( 5.5  5.5 0.2)
            (16.5 16.5 5  )
        )
        (
            (5.5 20 0.2)
            (5.5 20 5)
        )
        (
            (5.5 20 0.2)
            (5.5 20 5)
        )
        */
    )
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    back
    {
        type patch;
        faces
        (
            (3 7 6 2)
        );
    }

    front
    {
        type patch;
        faces
        (
            (1 5 4 0)    
        );
    }

    up
    {
        type patch;
        faces
        (
            (4 5 6 7)            
        );
    }

    down
    {
        type patch;
        faces
        (
            (0 3 2 1)            
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
