run/cases/RELPimpleFoam/system/functionsLib/fieldAverageDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

fieldAverage_object
{
    type                fieldAverage;
    libs                ("libfieldFunctionObjects.so");
    log                 true;
    writeControl        writeTime;
    
    fields              (U p);
}