run/cases/RELPimpleFoam/system/functionsLib/forceCoeffsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

forceCoeffs_object
{
    type                forceCoeffs;            // 指定类型为力系数，该项为必选项
    libs                ("libforces.so");
    log                 true;
        
    patches             ("body");               // 指定参与计算的边界名称，此项为必选项

    liftDir             (0 0 1);                // 升力方向
    dragDir             (1 0 0);                // 阻力方向
    pitchAxis           (0 1 0);                // 俯仰轴
    magUInf             1.0;                    // 参考速度
    lRef                1;                      // 用于力矩计算的参考长度
    Aref                1;                      // 用于系数计算的参考面积

    // 指定变量名称
    pName               p;
    Uname               U;
 
    // 仅用于不可压缩流动
    rho                 rhoInf;
    rhoInf              1.0;

    CofR                (1.0 0.5 0.3);// 指定旋转中心坐标

    // 指定数据的写入频率
    writeControl        timeStep;
    writeInterval       1;
}