run/cases/RELPimpleFoam/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default                             Euler;
}

gradSchemes
{
    default                             Gauss linear;
}

divSchemes
{
    default                             none;
    div(phi,U)                          bounded Gauss linearUpwindV grad(U);
    div(phi,k)                          Gauss limitedLinear 1;
    div(phi,omega)                      Gauss limitedLinear 1;
    div((nuEff*dev2(T(grad(U)))))       Gauss linear;
}

laplacianSchemes
{
    default                         Gauss linear corrected;
}

interpolationSchemes
{
    default                         linear;
}

snGradSchemes
{
    default                         corrected;
}

wallDist
{
    method                          meshWave;
}

// ************************************************************************* //
