run/cases/RELPimpleFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver                  GAMG;
        tolerance               1e-06;
        relTol                  0.01;
        smoother                GaussSeidel;
        nCellsInCoarsestLevel   20;
    }
    pFinal
    {
        solver                  GAMG;
        tolerance               1e-07;
        relTol                  0.0;
        smoother                GaussSeidel;
        nCellsInCoarsestLevel   20;
    }

    "(U|k|omega)"
    {
        solver                  smoothSolver;
        smoother                GaussSeidel;
        nSweeps                 2;
        tolerance               1e-06;
        relTol                  0.1;
    }
    "(U|k|omega)Final"
    {
        solver                  smoothSolver;
        smoother                GaussSeidel;
        nSweeps                 2;
        tolerance               1e-07;
        relTol                  0.0;
    }
}

PIMPLE
{
    nOuterCorrectors            1;
    nCorrectors                 2;
    nNonOrthogonalCorrectors    1;
    pRefCell                    0;
    pRefValue                   0;
}

relaxationFactors
{
    equations
    {
        ".*"                1;
    }
}

// ************************************************************************* //
